{"posts":[{"title":"GSoC 2025 Zarr: Bit Packing Compression","text":"Abstract Body","link":"/2025/03/08/gsoc2025archive/"},{"title":"Traffic Congestion Control by Centralized Vehicle Takeover in Smart City with Agent-Based Model","text":"Investigate how effectively a centralized takeover strategy can mitigate traffic congestion in simulated highway based on agent-based model in a smart city context. Github: Laika404/ComputationalProject This project tried to investigate how effectively a centralised takeover strategy can mitigate traffic congestion in simulated highway based on agent-based model. This was done through the reproduction of an already existent agent-based model based on a paper by [1]. The model was expanded upon by adding agent behaviour for multiple lanes and logic that simulates a central controller. It was hypothesized that centralized vehicle takeover will be significantly more effective than human-based models in mitigating congestion. This was confirmed as the central vehicle takeover managed to increase the average speed of the vehicles and maintain a higher flow under congested conditions. My RoleDefining Model Classes, data visualization, poster creation, speaker for pitch and Q&amp;A. Visualization Poster Documentation LinkFinal Report: PCS_report.pdfFinal Poster: Poster.pdf [1] Zhang, Fa, Jinling Li, and Qiaoxia Zhao (2005). “Single-lane traffic simulation with multi-agent system”. In: Proceedings. 2005 IEEE Intelligent Transportation Systems, 2005. IEEE, pp. 56–60.","link":"/2025/03/30/computationalProject/"},{"title":"GSoC Latex Templete","text":"Self made open source Latex Template for GSoC GSoC_latex_templateA custom Latex template for the Google Summer of Code, based on the template originally from University of Amsterdam UvA Informatica Template Artikel by Robert van Wijk Title PageSuitable Title page to include all the personal, organization, mentor, and project information. Work Breakdown Structure GraphUpdated work breakdown structure graph based on the work of Gonzalo Medina Proposal RequirementListed requirements for the proposal based on the webpage of Writing a proposal by GSoC Guide and Proposal Template by NumFOCUS","link":"/2025/03/08/gsoclatex/"},{"title":"Peer-to-Peer","text":"Pear-to-Peer is an innovative web application designed to enhance the educational experience for both teachers and students from UvA. Our platform allows teachers to easily manage assignments and facilitates a robust peer review process among students, supported by advanced AI technologies. Github: Janourid/PSE Our project is a web application that empowers teachers to elevate the quality of education they provide. Teachers can effortlessly submit assignments for their courses, and students can conveniently submit their work through the platform. Once a student submits their assignment, it is then assigned to another student for review. This peer review process is central to our platform, fostering a collaborative learning environment. What sets our product apart is our commitment to enhancing the quality of peer reviews. Before a reviewer receives an assignment, it is processed through a Large Language Model (LLM). This advanced AI technology thoroughly examines the submitted code, identifying areas for potential improvement. It then provides the reviewer with insightful hints and guidance on what to look for during their review. This not only helps reviewers provide more constructive feedback but also aids in their own learning and understanding of the subject matter. By leveraging cutting-edge AI, Pear-to-Peer not only streamlines assignment management but also enriches the educational experience by ensuring that peer reviews are thorough, insightful, and beneficial for all students involved. Our goal is to create a supportive educational ecosystem where both teachers and students can thrive. This project is based on the course Project Software Engineering of UvA. My roleOrganize daily stand-ups and plannings. Implement backend api for Admin page and connection with the database. Features For Teachers Assignment Management: Teachers can easily create, manage, and assign coursework to students. Submission Tracking: Monitor student submissions and track the review process efficiently. For Students Submission Portal: Students can submit their assignments through an intuitive interface. Peer Reviews: After submission, assignments are randomly assigned to other students for review. AI-Powered Review AssistanceWhat sets Pear-to-Peer apart is our integration of a Large Language Model (LLM) to assist in the peer review process: Automated Code Analysis: Before a student reviewer receives an assignment, our LLM analyzes the submitted code to identify potential areas of improvement. Review Guidance: The LLM provides hints and suggestions to the reviewer, helping them focus on critical aspects of the code and enhancing the quality of feedback. Tech Stack Frontend: React, Remix, Figma Backend: Flask, SQLAlchemy Other: Github, OpenAI, Docker","link":"/2025/03/30/project-peer-to-peer/"}],"tags":[{"name":"gsoc","slug":"gsoc","link":"/tags/gsoc/"},{"name":"zarr","slug":"zarr","link":"/tags/zarr/"},{"name":"open source","slug":"open-source","link":"/tags/open-source/"},{"name":"uva","slug":"uva","link":"/tags/uva/"}],"categories":[{"name":"GSoC","slug":"GSoC","link":"/categories/GSoC/"},{"name":"Projects","slug":"Projects","link":"/categories/Projects/"},{"name":"GSoC 2025","slug":"GSoC/GSoC-2025","link":"/categories/GSoC/GSoC-2025/"}],"pages":[{"title":"About me","text":"Currently pursuing a Bachelor’s degree in Computer Science at the University of Amsterdam and a Certificate in Quantitative Finance through the CQF Institute. Fluent in three languages and equipped with programming skills in C++ and Python. EducationCertificate in Quantitative Finance, The CQF InstituteMar 2025 - Jan 2026 (Expected) The world’s largest, master’s-level professional qualification in quant finance. The Certificate in Quantitative Finance (CQF) provides most recent quant finance and machine learning skills essential to a career success. Delivered online and part-time by industry leaders, CQF teach the practical implementation of current, real-world techniques. (Link to CQF) 7 Core Modules: Building Blocks of Quantitative Finance Quantitative Risk &amp; Return Equities &amp; Currencies Data Science &amp; Machine Learning I Data Science &amp; Machine Learning II Fixed Income &amp; Credit Advanced Electives Ba. Computer Science, University of AmsterdamSep 2022 - Sep 2026 (Expected) Average Grade: 7.5/10 Courses (Link to curriculum): Algorithm &amp; Complexity Statistics &amp; Reasoning (Machine Learning) Distributed &amp; Parallel Computing Introduction Information Theory Modern Cryptography Introduction Quantum Computing Project Computational Science Project Software Engineering Work ExperienceSoftware Engineer &amp; Study Coordinator, CMC Tasly Group B.V. | Shenzhou Open UniversityPart-time, Sep 2022 - Present Design and implement apprenticeship reservation website for student and clinic. Full stack using Next.Js, Tailwind CSS, and deployed on Vercel. Manage student digital learning platform “Moodle”, like setting up course contents, homework or portfolio assignment, and student enrollment Tech Stack Programming Language: Python, C, C++, Haskell, Latex Developer Tools: Linux, VS Code, Microsoft Office Frameworks: Flask, NextJs Database: SQLite Version Control: Git Language English (CEFR C1) Dutch (CEFR C1) Chinese (HSK 6/CEFR C2)","link":"/about/index.html"},{"title":"Projects","text":"","link":"/projects/index.html"}]}